[
  {
    "year": "2022 - 2023",
    "role": "Software Engineer",
    "company": "Wistia",
    "location": "Remote",
    "description": "Led the integration and refinement of React-based admin features like super jump and recent accounts, enhancing user interaction and system efficiency. Spearheaded the migration to React and Cypress.io for better component management and robust end-to-end testing. Implemented GitHub Actions for CI/CD, streamlining pipeline processes and improving deployment practices. Focused on front-end security by resolving critical XSS vulnerabilities and ensuring high code quality through rigorous PR reviews and test-driven development. Co-developed training material for on-call engineering duties using Pager Duty, enhancing operational readiness and responsiveness.",
    "technologies": ["React", "JavaScript", "TypeScript", "Ruby", "Ruby on Rails"],
    "link": "https://wistia.com/"
  },
  {
    "year": "2023 — Present",
    "role": "Developer Relations (Volunteer) ",
    "company": "Resilient Coders",
    "location": "Boston, MA",
    "description": "Facilitated community engagement activities, including events and online discussions, for a 400+ member engineering community, fostering collaboration and enhancing peer learning. Supported hackathon and recruitment efforts to identify and attract aspiring software engineers. Engaged directly with the leadership team on strategic initiatives, boosting the organization's brand and outreach effectiveness.",
    "technologies": ["React", "HTML", "CSS", "JavaScript", "TypeScript", "GraphQL", "Node.js", "Jest", "Cypress", "Python", "CI/CD tools"],
    "link": "https://www.resilientcoders.org/"
  },
  {
    "year": "2021 — 2022",
    "role": "Software Engineer",
    "company": "Resilient Coders",
    "location": "Remote",
    "description": "Collaborated with developer teams to design and build responsive full-stack web applications, adhering to best practices. Created semantically structured full-stack applications for mobile and desktop, maintaining detailed Git history using GitHub. Designed logos and multi-page layouts while developing responsive HTML/CSS layouts to improve website usability and accessibility. Gathered and refined project specifications, contributing to a 15% reduction in turnaround time. Maintained comprehensive software documentation to enhance project transparency and collaboration.",
    "technologies": ["React", "HTML", "CSS", "JavaScript", "TypeScript", "GraphQL", "Node.js", "Jest", "Cypress", "Python", "CI/CD tools"],
    "link": "https://www.resilientcoders.org/"
  },
  {
    "year": "Dec 2010 — Mar 2022",
    "role": "Multiple Roles",
    "company": "US Army · Reserves",
    "location": "Multiple",
    "description": "Supported Covid-19 Pandemic Relief Efforts through deployment in 2020. Led and trained teams of up to 45 soldiers in classroom and practical settings on HUMINT, power generation, and basic soldier functions. Acquired training in conflict resolution and managing large groups of people. Led groups of up to 20 to accomplish missions, including detainee operations and organizing inventory for a battalion-sized element.",
    "technologies": ["Electrical Engineering, IT related technologies"],
    "link": "https://www.army.mil/"
  }
]
