[
  {
    "year": "2023 — Present",
    "role": "Developer Relations (Volunteer) ",
    "company": "Resilient Coders",
    "location": "Boston, MA",
    "description": "Facilitated community engagement activities, including events and online discussions, for a 400+ member engineering community, fostering collaboration and enhancing peer learning. Supported hackathon and recruitment efforts to identify and attract aspiring software engineers. Engaged directly with the leadership team on strategic initiatives, boosting the organization's brand and outreach effectiveness.",
    "technologies": ["React", "HTML", "CSS", "JavaScript", "TypeScript", "GraphQL", "Node.js", "Jest", "Cypress", "Python", "CI/CD tools"],
    "link": "https://www.resilientcoders.org/"
  },
  {
    "year": "2022 - 2023",
    "role": "Software Engineer",
    "company": "Wistia",
    "location": "Remote",
    "description": "Led the migration of front-end tools to React and Cypress.io, enhancing component management and significantly boosting testing reliability. By implementing and streamlining CI/CD processes using GitHub Actions, I reduced pipeline complexity and accelerated deployment cycles. My work involved addressing critical XSS vulnerabilities and conducting rigorous PR reviews to uphold high standards of code quality and front-end security. I also collaborated with cross-functional teams to optimize the React-based admin dashboard, which improved user interaction, experience, and operational efficiency. Additionally, I co-developed training materials for on-call engineering tasks using Pager Duty, ensuring our team’s readiness and fostering operational excellence.",
    "technologies": ["React", "JavaScript", "TypeScript", "Ruby", "Ruby on Rails"],
    "link": "https://wistia.com/"
  },
  {
    "year": "2021 — 2022",
    "role": "Software Engineer",
    "company": "Resilient Coders",
    "location": "Remote",
    "description": "I collaborated with development teams to design responsive full-stack web applications, prioritizing user experience and cross-platform compatibility for desktop, iOS, Android, and tablet devices. By developing semantically structured HTML/CSS layouts and optimizing application performance, I enhanced usability, accessibility, and achieved a substantial decrease in load times. I also partnered with UX/UI designers to create user-centric features, delivering a seamless experience. Additionally, I maintained a detailed Git history on GitHub to support team collaboration and contributed to brand consistency through logo designs and multi-page layouts. Implementing scalable, cutting-edge technologies ensured the longevity and adaptability of each solution.",
    "technologies": ["React", "HTML", "CSS", "JavaScript", "TypeScript", "GraphQL", "Node.js", "Jest", "Cypress", "Python", "CI/CD tools"],
    "link": "https://www.resilientcoders.org/"
  },
  {
    "year": "Dec 2010 — Mar 2022",
    "role": "Multiple Roles",
    "company": "US Army · Reserves",
    "location": "Multiple",
    "description": "I led technical projects that improved team collaboration and managed timelines, organizing training events that boosted operational readiness by 25%. I also managed $500k worth of sensitive equipment, implementing stringent control measures to ensure zero loss and maximum accountability. By developing a weekly maintenance program, I improved operational readiness by 19% over six months and trained 22 operators on routine upkeep. Additionally, I led and trained teams of up to 45 soldiers in both classroom and practical settings, focusing on power generation and essential soldier functions. My efforts to streamline technical operations across IT, engineering, and intelligence led to significant improvements in efficiency and performance. I also spearheaded critical intelligence projects, providing actionable insights that enhanced mission success rates, while developing and implementing advanced engineering solutions that drove innovation and operational improvements. Coordinating cross-functional teams to achieve strategic objectives, I fostered a collaborative environment that significantly enhanced team productivity.",
    "technologies": ["Electrical Engineering, IT related technologies"],
    "link": "https://www.army.mil/"
  }
]
